# 분할 정복 알고리즘 (Dividied & Conquer Algorithm)
"""
직접 해결할 수 있을 정도로 간단한 문제가 될 때 까지 문제를 재귀적으로 쪼갠 후 조합하며 문제를 해결 (병합 정렬)
  * 병합 정렬을 통해 분할 정복 알고리즘을 설명한 것은 폰노이만의 1945년이었음
  * 문제를 축소하여 해결하는 개념은 유클리드의 '원론'에서 최대 공약수 알고리즘이었음
  * 최적 부분 구조 (Optimal Substrcture) 풀이에서 중요한 기법 중 하나임

분할 정복 알고리즘 Flow
  * 분할: 문제를 동일한 유형의 여러 하위 문제로 나눔
  * 정복: 가작 작은 단위의 하위 문제를 해결하여 정복
  * 조합: 하위 문제에 대한 결과를 원래 문제에 대한 결과로 조합
"""

# 수도 코드
"""
function F(x):
    if F(x)가 간단한 than: 
        return F(x)를 계산한 값
        ----- 정복
    else:
        x를 x1과 x2로 분할
        F(x1)와 F(x2)를 호출
        return F(x1)와 F(x2)로 F(x)를 구한 값
e
        ----- 조합과 분할

"""
